In [2]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series([7,15,4,4,7,4],index=['r1','r2','r3','r4','r5','r6'])
s

r1     7
r2    15
r3     4
r4     4
r5     7
r6     4
dtype: int64

In [4]:
s.r2

np.int64(15)

In [5]:
s[1]

/tmp/ipykernel_9508/878419959.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[1]

np.int64(15)

In [6]:
s.values

array([ 7, 15,  4,  4,  7,  4])

In [8]:
s.value_counts()

4     3
7     2
15    1
Name: count, dtype: int64

In [9]:
df = pd.DataFrame([[1,8],[3,4],[5,9],[7,2],[2,6]],index=['R1','R2','R3','R4','R5'],columns=['C1','C2'])
df

    C1  C2
R1   1   8
R2   3   4
R3   5   9
R4   7   2
R5   2   6

In [17]:
df[1:2]

    C1  C2
R2   3   4

In [18]:
df['C1']

R1    1
R2    3
R3    5
R4    7
R5    2
Name: C1, dtype: int64

In [19]:
df.iloc[2,1]

np.int64(9)

In [20]:
df[df<5]

     C1   C2
R1  1.0  NaN
R2  3.0  4.0
R3  NaN  NaN
R4  NaN  2.0
R5  2.0  NaN

In [21]:
df.head(3)

    C1  C2
R1   1   8
R2   3   4
R3   5   9

In [22]:
df.tail(2)

    C1  C2
R4   7   2
R5   2   6

In [23]:
df.index

Index(['R1', 'R2', 'R3', 'R4', 'R5'], dtype='object')

In [24]:
df.columns

Index(['C1', 'C2'], dtype='object')

In [25]:
df

    C1  C2
R1   1   8
R2   3   4
R3   5   9
R4   7   2
R5   2   6

In [26]:
df.T

    R1  R2  R3  R4  R5
C1   1   3   5   7   2
C2   8   4   9   2   6

In [27]:
df.drop('R3',axis=0)

    C1  C2
R1   1   8
R2   3   4
R4   7   2
R5   2   6

In [28]:
df.drop('C2',axis=1)

    C1
R1   1
R2   3
R3   5
R4   7
R5   2

In [29]:
df.describe()

             C1        C2
count  5.000000  5.000000
mean   3.600000  5.800000
std    2.408319  2.863564
min    1.000000  2.000000
25%    2.000000  4.000000
50%    3.000000  6.000000
75%    5.000000  8.000000
max    7.000000  9.000000

In [30]:
df = pd.DataFrame([[1,2],[3,4],[5,6]],index=('x1','x2','x3'),columns=(0,1))
df

    0  1
x1  1  2
x2  3  4
x3  5  6

In [31]:
df = pd.DataFrame({'x1':[1,2],'x2':[3,4],'x3':[5,6]})
df

   x1  x2  x3
0   1   3   5
1   2   4   6

In [32]:
data = {'Name': ["Ali", "Sara", "Reza", "Taha"],
        'Location' : ["yazd", "Theran", "shiraz", "Hamedan"],
        'Age' : [35, 28, 55, 5]
       }

df = pd.DataFrame(data)
df

   Name Location  Age
0   Ali     yazd   35
1  Sara   Theran   28
2  Reza   shiraz   55
3  Taha  Hamedan    5

In [ ]:
df.sort_index(axis=1,ascending=False)

   Name Location  Age
0   Ali     yazd   35
1  Sara   Theran   28
2  Reza   shiraz   55
3  Taha  Hamedan    5

In [40]:
df.sort_index(axis=0,ascending=False)

   Name Location  Age
3  Taha  Hamedan    5
2  Reza   shiraz   55
1  Sara   Theran   28
0   Ali     yazd   35

In [41]:
df.sort_values('Age')

   Name Location  Age
3  Taha  Hamedan    5
1  Sara   Theran   28
0   Ali     yazd   35
2  Reza   shiraz   55

In [42]:
df[df.Age<30]

   Name Location  Age
1  Sara   Theran   28
3  Taha  Hamedan    5

In [43]:
df.iloc[1][2]

/tmp/ipykernel_9508/65333983.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][2]

np.int64(28)

In [44]:
df.iloc[1]['Age']

np.int64(28)

In [45]:
pd.DataFrame(np.random.randn(10,4))

          0         1         2         3
0 -0.564941  0.670679  0.553150  0.561879
1  1.100733  1.857395 -0.207163  0.398455
2  1.868994  2.924604 -0.084039 -0.876346
3  0.735112 -2.764734  0.848537  0.801854
4 -0.266357 -0.476942 -0.476456  0.530040
5  0.186159 -0.486694  0.223167  0.367270
6 -2.527387  0.099168  0.038696 -1.013552
7  0.647082  0.164449  0.662249  0.281493
8 -0.111654 -0.803286 -1.009244 -0.851311
9  0.134726 -0.835194  1.099504  1.813825